Revit 2024 API
MultistoryStairs.IsPinned Method
 Checks if a stair is pinned.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool IsPinned(
	Stairs stairs
)
Visual Basic
Public Function IsPinned ( _
	stairs As Stairs _
) As Boolean
Visual C++
public:
bool IsPinned(
	Stairs^ stairs
)
Parameters
stairs
Type: Autodesk.Revit.DB.Architecture.Stairs
 A stairs element in this multistory stairs element.
Return Value
 Returns true if the stairs is pinned; otherwise returns false.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input stairs is not a member of this multistory stairs.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace